import React from "react";

export const ScheduleHTML: React.FC = () => {
  return (
    <div className="text-left w-max mt-2 px-4 mx-auto text-gray-600" style={{ width: '100vw', maxWidth:'450px', wordWrap: 'break-word' }}>
      <div>
        <b>🗓️ 21-23.03.2025 - 1 модуль: Робота з фігурками та символами в індивідуальній практиці</b>
      </div>

      <div className="mt-6">
        <b>🗓️ 16-18.05.2025 - 2 модуль: Робота з ресурсною картою (птахом роду)</b>
        <p className='ml-4'>Налаштування, навчання навичкам, практика</p>
      </div>

      <div className="mt-6">
        <b>🗓️ 26-28.09.2025 - 3 модуль: Повертайся. Робота з загубленими частинами душі</b>
      </div>

      <div className="mt-6">
        <b>🗓️ 14-16.11.2025 - 4 модуль: Шаманське коло як інструмент для діагностики та роботи з запитом клієнта</b>
      </div>

      <div className="mt-6">
        <b>🗓️ 16-18.01.2026 - 5 модуль: Робота з кордоном між живим та мертвим: "Ти там, а я тут"</b>
      </div>

      <div className="mt-6">
        <b>🗓️ 27.02-01.03.2026 - 6 модуль: Шаманська терапевтична подорож</b>
        <p className='ml-4'>Взаємодія з архетипами природних сил у контексті реальності декількох вимірів</p>
      </div>

      <div className="mt-6">
        <b>🗓️ 10-12.04.2026 - 7 модуль: Сертифікація</b>
        <p className='ml-4'>Сертифікаційна робота під супервізією, видача сертифікату про проходження навчальної програми</p>
      </div>
    </div>
  );
};
